Enterprise_Serivces/Cert/Bronze3/CSLOfferService/result1/Iteration1060/t1_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/offer/contracts/2010/05/IOfferService/CreateOfferForCustomer</wsa:Action><wsa:MessageID>uuid:0236144f-a88f-44dd-a021-102b5b942acf</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslofferserviceqa1.testgs.pvt/OfferService.svc</wsa:To></soap:Header><soap:Body><CreateOfferForCustomer xmlns="http://www.gamestop.com/services/csl/offer/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">PerfTest</MachineName><CampaignID xmlns="http://www.gamestop.com/services/csl/offer/messages/2010/05">3282</CampaignID><CustomerID xmlns="http://www.gamestop.com/services/csl/offer/messages/2010/05">1239934086</CustomerID></request></CreateOfferForCustomer></soap:Body></soap:Envelope>